using UnityEngine;
using System.Collections;
using System.Collections.Generic;

// ============================================ 
// Editor      : Strix                               
// Date        : 2017-01-23 오후 1:44:15
// Description : 
// Edit Log    : 
// ============================================ 

public class CCompoDontDestroyObj : CObjectBase
{
    // ===================================== //
    // public - Variable declaration         //
    // ===================================== //

    // ===================================== //
    // protected - Variable declaration      //
    // ===================================== //

    // ===================================== //
    // private - Variable declaration        //
    // ===================================== //
    
    // ========================================================================== //

    // ===================================== //
    // public - [Do] Function                //
    // 외부 객체가 요청                      //
    // ===================================== //

    // ===================================== //
    // public - [Getter And Setter] Function //
    // ===================================== //

    // ========================================================================== //

    // ===================================== //
    // protected - [Event] Function          //
    // 프랜드 객체가 요청                    //
    // ===================================== //

    // ===================================== //
    // protected - Unity API                 //
    // ===================================== //

    protected override void OnAwake()
    {
        base.OnAwake();

        Transform pTransformRoot = transform;
        while (pTransformRoot.parent != null)
        {
            pTransformRoot = transform.parent;
        }

        DontDestroyOnLoad(pTransformRoot.gameObject);
    }

    // ========================================================================== //

    // ===================================== //
    // private - [Proc] Function             //
    // 중요 로직을 처리                      //
    // ===================================== //

    // ===================================== //
    // private - [Other] Function            //
    // 찾기, 계산 등의 비교적 단순 로직      //
    // ===================================== //

}
